'''
В цьому модулі знаходяться функції допомагають та вирішують задачу комівояжера
'''

def read_file(file_path:str):
    '''
    Ця функція повинна читати .csv файл та повертати дані з якими можна працювати.
    В .csv файлі дані задані у форматі x1,x2,l1, де x1 - перше місто,
    x2 - друге місто, l1 - вага ребра між ними (довжина шляху між містами)
    '''
    return

def precise_alg():
    '''
    Ця функція вирішує задачу комівояжера точним алгоритмом (Held-Karp algorythm)
    '''
    return

def greedy_alg():
    '''
    Ця функція вирішує задачу комівояжера "жадібним" приблизним алгоритмом 
    (Nearest neighbour algorithm)
    '''
    return

if __name__ == '__main__':
    import doctest
    print(doctest.testmod)
    #тут може бути запуск функцій вручну
